Autodesk.Revit.DB.CurveByPoints.ReferenceType
Indicates the type of reference.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown when argument is out of range.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when regeneration failed.

Autodesk.Revit.DB.CurveByPoints.Visible
Whether the point is visible when the family is loaded
into a project.

Autodesk.Revit.DB.CurveByPoints.Subcategory
The subcategory, or graphics style, of the CurveByPoints.
Remarks: If the family category is non-cuttable, the subcategory can be
set to be the family category or one of its subcategories.
If the family category is cuttable, the subcategory can be set as the graphics
styles of the family category, its subcategories, or the invisible lines
graphics style.

Autodesk.Revit.DB.CurveByPoints.SetVisibility(Autodesk.Revit.DB.FamilyElementVisibility)
Sets the visibility.
Remarks: The visibility of the CurveByPoints can be changed for different
types of views and detail levels in the project.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when visibility is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when regeneration failed.

Autodesk.Revit.DB.CurveByPoints.GetVisibility
Gets the visibility.
Returns: A copy of visibility settings for the curve.

Autodesk.Revit.DB.CurveByPoints.SortPoints(Autodesk.Revit.DB.ReferencePointArray)
Order a set of ReferencePoints in the same way Revit does
when creating a curve from points.
Remarks: Finds a best-fit line to the points by the least squares method,
and orders the points by their projection onto the line.
Returns: False if the least-squares method is unable to find a solution;
true otherwise.
arr: An array of ReferencePoints. The array is reordered
if sortPoints returns true, and is unchanged if
sortPoints returns false.

Autodesk.Revit.DB.CurveByPoints.SetPoints(Autodesk.Revit.DB.ReferencePointArray)
Change the sequence of points interpolated by this curve.
points: An array of 2 or more ReferencePoints.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when
the array contains fewer than 2 points, when the array
contains duplicates, or when adjacent points are
located too close together.

Autodesk.Revit.DB.CurveByPoints.GetPoints
Get the sequence of points interpolated by this curve.

Autodesk.Revit.DB.CurveByPoints.SketchPlane
Override the SketchPlane property of CurveElement.
Remarks: CurveByPoints has no associated SketchPlane. Getting this
property returns null. Setting it causes an InvalidOperationException.

Autodesk.Revit.DB.CurveByPoints
A curve interpolating two or more points.
Remarks: The points to be interpolated are represented as
ReferencePoints, which must already exist in the
document. In terms of appearance and graphics control,
CurveByPoints behaves similarly to ModelCurve. The main
difference being that a ModelCurve refers to a SketchPlane,
while a CurveByPoints does not.
For more methods capable of accessing data from CurveByPoints elements,
see the static class CurveByPointsUtils.